In [1]:
import pandas as pd

In [2]:
# Lista de notas dos alunos
notas_alunos = [92,81,100,92,71,73,100,92,84,100,73,92,73,84,92,92,92,84,73,100]

In [3]:
len(notas_alunos)

20

In [16]:
# Solução em Serie Pandas
df1 = pd.Series(notas_alunos).value_counts().reset_index().sort_values('index').reset_index( drop = True)
df1.columns = ['Nota', 'Frequência']
df1

   Nota  Frequência
0    71           1
1    73           4
2    81           1
3    84           3
4    92           7
5   100           4

In [17]:
# Utilizando bins para pegar faixas de valor
df2 = pd.Series(notas_alunos).value_counts(bins = 3).reset_index().sort_values('index').reset_index( drop = True)
df2.columns = ['Nota', 'Frequência']
df2

               Nota  Frequência
0   (70.97, 80.667]           5
1  (80.667, 90.333]           4
2   (90.333, 100.0]          11

# Dataframe do pandas

### Frequência Simples ou Absoluta - fi

In [18]:
df3 = pd.value_counts(notas_alunos).to_frame(name = "fi").rename_axis('Nota').sort_index()
print(df3)

      fi
Nota
71     1
73     4
81     1
84     3
92     7
100    4

### Frequência Relativa Simples - fri

In [22]:
df3['fri'] = pd.value_counts(notas_alunos) / len(notas_alunos)
df3

      fi   fri
Nota
71     1  0.05
73     4  0.20
81     1  0.05
84     3  0.15
92     7  0.35
100    4  0.20

### Frequência Acumulada - Fi

In [23]:
df3['FI'] = df3.fi.cumsum()
print(df3)

      fi   fri  FI
Nota
71     1  0.05   1
73     4  0.20   5
81     1  0.05   6
84     3  0.15   9
92     7  0.35  16
100    4  0.20  20